software-engineering/debug/log-system.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-26 四 14:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>日志系统</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">日志系统</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org855461b">1. 概述</a></li>
<li><a href="#org511643d">2. 分类</a></li>
<li><a href="#orga41d186">3. 原则</a></li>
<li><a href="#org8cf72a3">4. 数据</a></li>
<li><a href="#orgd112156">5. tip</a></li>
</ul>
</div>
</div>

<div id="outline-container-org855461b" class="outline-2">
<h2 id="org855461b"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
通过日志可以：
</p>
<ol class="org-ol">
<li>了解线上系统的运行状态</li>
<li>快速准确定位线上问题</li>
<li>发现系统瓶颈</li>
<li>预警系统潜在风险</li>
<li>挖掘产品最大价值</li>
<li>……</li>
</ol>
</div>
</div>

<div id="outline-container-org511643d" class="outline-2">
<h2 id="org511643d"><span class="section-number-2">2</span> 分类</h2>
<div class="outline-text-2" id="text-2">
<p>
日志从功能来说，可以分为：
</p>
<ul class="org-ul">
<li>诊断日志：调试代码、追踪问题，输出到控制台。</li>
<li>统计日志：统计请求、数据埋点，格式化输出，方便进一步数据处理。</li>
</ul>
</div>
</div>

<div id="outline-container-orga41d186" class="outline-2">
<h2 id="orga41d186"><span class="section-number-2">3</span> 原则</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>日志打印不能阻塞业务流程。</li>
<li>不同功能或类型的日志输出到不同文件。</li>
<li>日子文件按时间进行分割，方便定位问题。</li>
<li>日志中的信息量应该合理，不多不少。</li>
<li>日志需要不断优化。</li>
<li>请求处理流程应该使用 RequestID 串起来。</li>
<li>日志格式应该统一规范。</li>
</ul>
</div>
</div>

<div id="outline-container-org8cf72a3" class="outline-2">
<h2 id="org8cf72a3"><span class="section-number-2">4</span> 数据</h2>
<div class="outline-text-2" id="text-4">
<p>
下面这些数据应该打印：
</p>
<ul class="org-ul">
<li>服务启动参数，初始化流程。</li>
<li>代码异常处理逻辑。</li>
<li>请求和响应都应该打印，方便出问题的时候还原场景。</li>
</ul>
</div>
</div>

<div id="outline-container-orgd112156" class="outline-2">
<h2 id="orgd112156"><span class="section-number-2">5</span> tip</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>日志组件支持动态修改日志级别，方便线上调试 bug。例如可以当特定 userid，或参数中携带 <code>debug=on</code> 这样的参数时，就将日志级别修改为 <code>debug</code> ，打印更加详细的信息。</li>
<li>日志分割可以借助第三方工具来实现，并不一定需要日志组件支持。</li>
<li>分布式日志可以对接 ELK 等系统，方便汇总处理，形成图表。</li>
<li>使用格式化字符串拼装日志信息，不要使用字符串拼接。</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-26 四 14:32</p>
<p class="validation"></p>
</div>
</body>
</html>
